#pragma once

#include "HookAPI.h"
#include "../Global.h"
#include "Vec2.hpp"
#include "Vec3.hpp"
#include "BlockPos.hpp"
#include "AABB.hpp"
#include "ChunkPos.hpp"
#include "ChunkBlockPos.hpp"
#include "combaseapi.h"
typedef std::string xuid_t;
typedef unsigned long long QWORD;

namespace mce
{
class UUID
{
    uint64_t a, b;

public:
    MCAPI std::string asString() const;
    MCAPI static UUID fromString(std::string const&);
    MCAPI bool isEmpty() const;
    MCAPI static UUID seedFromString(std::string const&);
    MCAPI static class mce::UUID EMPTY;

    inline operator bool() const
    {
        return !isEmpty();
    }

     static UUID getUUID() {
        GUID guid;
        HRESULT h = CoCreateGuid(&guid);
        if (h == S_OK) {
            char buf[64] = { 0 };
            sprintf_s(buf, sizeof(buf),
                "%08X-%04X-%04X-%02X%02X-%02X%02X%02X%02X%02X%02X",
                guid.Data1, guid.Data2, guid.Data3,
                guid.Data4[0], guid.Data4[1], guid.Data4[2], guid.Data4[3],
                guid.Data4[4], guid.Data4[5], guid.Data4[6], guid.Data4[7]);		
            return seedFromString(std::string(buf));
        }
        else
        {
            return  mce::UUID::EMPTY;
        }
    }
};
class Color
{
public:
    float r;
    float g;
    float b;
    float a;
    Color(float r, float g, float b, float a = 1)
        : r(r)
        , g(g)
        , b(b)
        , a(a){};

    inline operator bool() const
    {
        return !(*this == NIL);
    }

    LIAPI double distanceTo(mce::Color const dst) const;
    LIAPI std::string toConsoleCode(bool foreground = true) const;
    LIAPI std::string toNearestColorCode() const;
    LIAPI static class mce::Color fromConsoleCode(std::string const&);
    LIAPI static class mce::Color fromColorCode(std::string const&);

    MCAPI static mce::Color const NIL;
    MCAPI static class mce::Color fromHexString(std::string const&);
    MCAPI bool operator==(class mce::Color const&) const;
    MCAPI int toABGR(void) const;
    MCAPI int toARGB(void) const;
    MCAPI std::string toHexString(void) const;

};

class Blob {
public:
    void* unk0;
    std::unique_ptr<unsigned char[]> buffer;
    size_t length = 0;
	

    inline Blob() {}
    inline Blob(Blob&& rhs) : buffer(std::move(rhs.buffer)), length(rhs.length) { rhs.length = 0; }
    inline Blob(size_t input_length) : buffer(std::make_unique<unsigned char[]>(input_length)), length(input_length) {}
    inline Blob(unsigned char const* input, size_t input_length) : Blob(input_length) {
        memcpy(buffer.get(), input, input_length);
    }

    inline Blob& operator=(Blob&& rhs) {
        if (&rhs != this) {
            buffer = std::move(rhs.buffer);
            length = rhs.length;
            rhs.length = 0;
        }
        return *this;
    }

    inline Blob clone() const { return { data(), size() }; }

    inline unsigned char* begin() { return buffer.get(); }
    inline unsigned char* end() { return buffer.get() + length; }
    inline unsigned char const* cbegin() const { return buffer.get(); }
    inline unsigned char const* cend() const { return buffer.get() + length; }

    inline unsigned char* data() { return buffer.get(); }
    inline unsigned char const* data() const { return buffer.get(); }

    inline bool empty() const { return length == 0; }
    inline size_t size() const { return length; }

    inline auto getSpan() const { return gsl::make_span(data(), size()); }

};

static_assert(sizeof(Blob) == 24);

enum class ImageFormat {
    NONE = 0,
    RGB = 1,
    RGBA = 2
};

enum class ImageUsage : int8_t {
    unknown = 0,
    sRGB = 1,
    data = 2
};

inline unsigned numChannels(ImageFormat format) {
    switch (format) {
    case ImageFormat::RGB:  return 3;
    case ImageFormat::RGBA: return 4;
    default:                return 0;
    }
}

class Image {
    inline Image(ImageFormat format, unsigned width, unsigned height, ImageUsage usage, Blob&& data)
        : format(format), width(width), height(height), usage(usage), data(std::move(data)) {}

public:
    ImageFormat format{}; // 0x0
    unsigned width{}, height{}; // 0x4, 0x8
    ImageUsage usage{}; // 0xC
    Blob data; // 0x10
	
    inline Image(Blob&& data) : data(std::move(data)) {}
    inline Image(unsigned width, unsigned height, ImageFormat format, ImageUsage usage)
        : format(format), width(width), height(height), usage(usage) {}
    inline Image() {}

    inline Image& operator=(Image&& rhs) {
        format = rhs.format;
        width = rhs.width;
        height = rhs.height;
        usage = rhs.usage;
        data = std::move(rhs.data);
        return *this;
    }

    inline Image clone() const { return { format, width, height, usage, data.clone() }; }

    inline void copyRawImage(Blob const& blob) { data = blob.clone(); }

    inline bool isEmpty() const { return data.empty(); }

    inline void resizeImageBytesToFitImageDescription() { data = Blob{ width * height * numChannels(format) }; }

    inline void setImageDescription(unsigned width, unsigned height, ImageFormat format, ImageUsage usage) {
        this->width = width;
        this->height = height;
        this->format = format;
        this->usage = usage;
    }

    inline void setRawImage(Blob&& buffer) { data = std::move(buffer); }
};

static_assert(offsetof(Image, data) == 0x10);
static_assert(offsetof(Image, format) == 0x0);
static_assert(offsetof(Image, usage) == 0xC);
static_assert(sizeof(Image) == 40);


}; // namespace mce

class BoundingBox
{
public:
    BlockPos bpos1;
    BlockPos bpos2;

    inline BlockPos getCenter() const
    {
        return {(bpos1.x + bpos2.x) / 2, (bpos1.y + bpos2.y) / 2, (bpos1.z + bpos2.z) / 2};
    }

    LIAPI AABB toAABB() const;
};

template <typename A, typename T>
class AutomaticID
{
    T id;

public:
    AutomaticID()
    {
        id = 0;
    }

    AutomaticID(T x)
    {
        id = x;
    }

    inline operator T() const
    {
        return id;
    }
};

#include "ActorUniqueID.hpp"

//static_assert(!std::is_pod_v<ActorUniqueID>);


class ActorRuntimeID
{
public:
    unsigned long long id;

    inline unsigned long long get() const
    {
        return id;
    }

    inline operator unsigned long long() const
    {
        return id;
    }
};
//static_assert(std::is_pod_v<ActorRuntimeID>);

#include "RelativeFloat.hpp"

//namespace Core {
//
//class PathPart {
//public:
//    std::string data;
//};
//
